# В переменной order храниться заказ на изготовление прямоугольных ковриков
# Для изготовления коврика используются 2 типа материалов
# 1. Материал из которого изготовлен сам коврик (площадь)
# 2. Материал из которого изготовлен кантик коврика (периметр)
# Написать программу которая считает общее количество материала на изготовление всего заказа
# carpet_material, edge_material
# Общее кол-во материала на каждый размер коврика

order = {
    'small': {'height': 40, 'width': 60, 'qty': 30},
    'medium': {'height': 70, 'width': 90, 'qty': 54},
    'large': {'height': 90, 'width': 120, 'qty': 15},
}
